In [1]:
import pandas as pd

# Cargar los archivos CSV proporcionados
merchant_df = pd.read_csv('./merchant.csv')
merchant_category_df = pd.read_csv('./merchant_category.csv')
card_holder_df = pd.read_csv('./card_holder.csv')
credit_card_df = pd.read_csv('./credit_card.csv')
transaction_df = pd.read_csv('./transaction.csv')

In [2]:

merchant_df.head()

   id                          name  id_merchant_category
0   1      Murphy, Heath and Fields                     1
1   2                   Riggs-Adams                     1
2   3  Sanders, Parks and Mcfarland                     2
3   4                Mccarty-Thomas                     3
4   5                Miller-Blevins                     4

In [3]:
merchant_category_df.head()

   id         name
0   1   restaurant
1   2  coffee shop
2   3          bar
3   4          pub
4   5   food truck

In [4]:
card_holder_df.head()

   id              name
0   1    Robert Johnson
1   2     Shane Shaffer
2   3  Elizabeth Sawyer
3   4    Danielle Green
4   5       Sara Cooper

In [5]:
credit_card_df.head()

                  card  cardholder_id
0     3517111172421930              1
1  4761049645711555811              1
2  4866761290278198714              2
3         675911140852              2
4       30078299053512              3

In [6]:
transaction_df.head()

     id                 date  amount              card  id_merchant
0   222  2018-01-01 21:35:10    6.22  3561954487988605           69
1  2045  2018-01-01 21:43:12    3.83  5135837688671496           85
2   395  2018-01-01 22:41:21    9.61   213193946980303           82
3  3309  2018-01-01 23:13:30   19.03  4263694062533017            5
4   567  2018-01-01 23:15:10    2.95     4498002758300           64

In [ ]:
#Verificar que que todos los propietarios de tarjetas de credito realmente existan
#We make sure there are no holderes that doesn't exist
mask_holder = credit_card_df["cardholder_id"].isin(card_holder_df["id"])

credit_card_df[~mask_holder]

Empty DataFrame
Columns: [card, cardholder_id]
Index: []

In [8]:
#Verificamos que no haya categorias no existentes
#We make sure there are no categories wich key doen't exist
mask_category = merchant_df['id_merchant_category'].isin(merchant_df['id'])

merchant_df[~mask_category]

Empty DataFrame
Columns: [id, name, id_merchant_category]
Index: []

In [9]:
#Verificamos que las tarjetas en las transacciones existen creando una mascara
#Here we check if all the cards in the transactions exist by creating a mask
mask_trans = transaction_df["card"].isin(credit_card_df["card"])

transaction_df[~mask_trans]

Empty DataFrame
Columns: [id, date, amount, card, id_merchant]
Index: []

In [10]:
#los registros de las cartas aparentemente esta en el formato correspondiente y ya sabemos que no hay nulos
#the card ins the transaction is aparently in the right format and we already cjeck there are no null values
transaction_df.head()

     id                 date  amount              card  id_merchant
0   222  2018-01-01 21:35:10    6.22  3561954487988605           69
1  2045  2018-01-01 21:43:12    3.83  5135837688671496           85
2   395  2018-01-01 22:41:21    9.61   213193946980303           82
3  3309  2018-01-01 23:13:30   19.03  4263694062533017            5
4   567  2018-01-01 23:15:10    2.95     4498002758300           64

In [11]:
#Transofrmamos las tarjetas en ambas tablas a string por recomendacion del auditor
transaction_df["card"]

0          3561954487988605
1          5135837688671496
2           213193946980303
3          4263694062533017
4             4498002758300
               ...
3495    4723783028106084756
3496    4165305432349489280
3497       5361779664174555
3498       4188164051171486
3499    4723783028106084756
Name: card, Length: 3500, dtype: int64

In [12]:
#con los registros en la credit card un problema y es que esta en notacion cientifica
#here we can see that the card is in scientific notation
credit_card_df.head()

                  card  cardholder_id
0     3517111172421930              1
1  4761049645711555811              1
2  4866761290278198714              2
3         675911140852              2
4       30078299053512              3

In [13]:
#Confirmando el data type vemos que esta en un float64 lo cual difiere con el 
#formato en de las trasnacciones ya que deben ser exactamente iguales

#if we look at the data type we'll see that is in float64 a diferent format
#from the transactions and this shoultnt be since as FK they must be equal
credit_card_df["card"].dtype

dtype('int64')

In [14]:
''' 
EL hecho de que las tarjetas esten en notacion cientifica es un
problema no solo por que difieren el dato de origen y el FK sino
por que la notacion cientifica es un aproximado a un numero no
el numero entero por lo que si lo convertimos a tipo int seguira 
sin haber coincidencias por que rellenara los espacios faltantes
con ceros en lugar de los numeros correspondientes

Como solucion si estos datos fueron extraidos de una db podriamso rastrear mediante 
'''

' \nEL hecho de que las tarjetas esten en notacion cientifica es un\nproblema no solo por que difieren el dato de origen y el FK sino\npor que la notacion cientifica es un aproximado a un numero no\nel numero entero por lo que si lo convertimos a tipo int seguira \nsin haber coincidencias por que rellenara los espacios faltantes\ncon ceros en lugar de los numeros correspondientes\n\nComo solucion si estos datos fueron extraidos de una db podriamso rastrear mediante \n'

In [15]:
#Verificamos si hay duplicados
#We Check for duplicates

In [16]:
credit_card_df[credit_card_df.duplicated()]

Empty DataFrame
Columns: [card, cardholder_id]
Index: []

In [17]:

card_holder_df[card_holder_df.duplicated()]

Empty DataFrame
Columns: [id, name]
Index: []

In [18]:
merchant_category_df[card_holder_df.duplicated()]

C:\Users\sebas\AppData\Local\Temp\ipykernel_20912\3221593387.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  merchant_category_df[card_holder_df.duplicated()]

Empty DataFrame
Columns: [id, name]
Index: []

In [19]:
merchant_df[merchant_df.duplicated()]

Empty DataFrame
Columns: [id, name, id_merchant_category]
Index: []

In [20]:
transaction_df[transaction_df.duplicated()]

Empty DataFrame
Columns: [id, date, amount, card, id_merchant]
Index: []

In [21]:
#Verificamos si hay nulos y los datos de las columnas
#CHeck if there are null values an the data type

In [22]:
card_holder_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25 entries, 0 to 24
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      25 non-null     int64
 1   name    25 non-null     object
dtypes: int64(1), object(1)
memory usage: 532.0+ bytes

In [23]:
merchant_category_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      5 non-null      int64
 1   name    5 non-null      object
dtypes: int64(1), object(1)
memory usage: 212.0+ bytes

In [24]:
merchant_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 3 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   id                    150 non-null    int64
 1   name                  150 non-null    object
 2   id_merchant_category  150 non-null    int64
dtypes: int64(2), object(1)
memory usage: 3.6+ KB

In [25]:
credit_card_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 53 entries, 0 to 52
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   card           53 non-null     int64
 1   cardholder_id  53 non-null     int64
dtypes: int64(2)
memory usage: 980.0 bytes

In [26]:
transaction_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3500 entries, 0 to 3499
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           3500 non-null   int64
 1   date         3500 non-null   object
 2   amount       3500 non-null   float64
 3   card         3500 non-null   int64
 4   id_merchant  3500 non-null   int64
dtypes: float64(1), int64(3), object(1)
memory usage: 136.8+ KB

In [27]:
transaction_df["date"] = pd.to_datetime(transaction_df["date"])

In [28]:
transaction_df.insert(1,"hour",transaction_df["date"].dt.time)
transaction_df.insert(1,"day",transaction_df["date"].dt.date)

In [29]:
#ahora es inutil la columna "date" ya que tenemos esa misma data, pero en dos columnas especificas par evita duplicidad podemos borrarla
#the dat column is useless knwo that we have the data but in two especific columns so to avoid duplicity we'll drop ot
transaction_df = transaction_df.drop(columns=["date"])

In [30]:
#just as my senior auditor told me we trasnform the cards into strings

In [31]:
credit_card_df
transaction_df["card"]
#credit_card_df["card"]

0          3561954487988605
1          5135837688671496
2           213193946980303
3          4263694062533017
4             4498002758300
               ...
3495    4723783028106084756
3496    4165305432349489280
3497       5361779664174555
3498       4188164051171486
3499    4723783028106084756
Name: card, Length: 3500, dtype: int64

In [32]:
from datetime import time

In [34]:
#transacciones hechas a altas horas de la mañana
#transactions made in the early morning
SixToEighTransacs = transaction_df.loc[(transaction_df["hour"]>=time(6,0,0)) & (transaction_df["hour"]<=time(8,0,0))]

In [43]:
SixToEighTransacs["amount"].describe()

count     301.000000
mean       54.443455
std       255.015171
min         0.560000
25%         3.610000
50%        10.370000
75%        14.940000
max      2001.000000
Name: amount, dtype: float64

In [45]:
SixToEighTransacs

        id         day      hour  amount                 card  id_merchant
28    1510  2018-01-04  06:34:37   10.22     4188164051171486           80
38    1552  2018-01-05  06:26:45   10.74      372414832802279           86
39     487  2018-01-05  06:27:06    4.60  4159836738768855913           48
40    2077  2018-01-05  07:19:27    1.36      344119623920892           30
47     846  2018-01-06  06:46:24    2.70      213193946980303          146
...    ...         ...       ...     ...                  ...          ...
3404  2715  2018-12-21  06:05:54   18.67  4761049645711555811          150
3417  3217  2018-12-23  07:39:47   19.27  4962915017023706562           35
3452  2324  2018-12-27  07:35:24    2.71     3561954487988605           90
3463  1093  2018-12-28  06:04:01   10.02      180098539019105           71
3464  3087  2018-12-28  07:02:38   17.13     4711773125020499           96

[301 rows x 6 columns]

In [36]:
suspiciusTransac = SixToEighTransacs.loc[(SixToEighTransacs["amount"]<2)]

In [68]:
#Comercios con mas transacciones sospechosas
#Merchants biggest amount of suspicious transactions 
Top_suspicious_merchants = suspiciusTransac.groupby(["id_merchant"])["id_merchant"].count().sort_values(ascending=False).head(6)
pd.DataFrame(Top_suspicious_merchants)

             id_merchant
id_merchant
12                     2
48                     2
82                     2
89                     2
114                    2
5                      1

In [66]:
#veremos los nombres con de los loscales con transacciones sospechosas
#We'll see the name of the merchants with suspicious transactions
suspicious_merchants = suspiciusTransac.groupby(["id_merchant"])["id_merchant"].count().sort_values(ascending=False)
mask_suspi_merch = merchant_df["id"].isin(suspicious_merchants.index)
merchant_df[mask_suspi_merch]

      id                           name  id_merchant_category
2      3   Sanders, Parks and Mcfarland                     2
4      5                 Miller-Blevins                     4
11    12        Bell, Gonzalez and Lowe                     4
14    15      Long, Harrell and Johnson                     5
20    21                Robertson-Smith                     4
22    23  Wilson, Roberts and Davenport                     5
29    30                   Atkinson Ltd                     3
47    48                      Baker Inc                     5
49    50                  Johnson-Watts                     1
59    60                 Smith-Richards                     4
61    62  Cooper, Carpenter and Jackson                     5
63    64        Cline, Myers and Strong                     1
81    82                     Day-Murray                     5
84    85                  Patton-Rivera                     3
88    89                 Kelley-Roberts                     5
97    98                     Rivera PLC                     4
101  102                   Walters-Ward                     1
113  114                    Greene-Wood                     3
116  117                 Mitchell Group                     2
118  119             Henderson and Sons                     1
120  121     Fleming, Smith and Collins                     3
122  123      Boone, Davis and Townsend                     4
125  126              Bartlett and Sons                     4
140  141                   Wood-Ramirez                     3
144  145                  Hood-Phillips                     3
146  147                 Marshall-Lopez                     5
148  149                 Clark and Sons                     5

In [74]:
#Top 6
top_suspicious_merchants = suspicious_merchants.sort_values(ascending=False).head(6)
top_suspicious_merchants

id_merchant
12     2
48     2
82     2
89     2
114    2
5      1
Name: id_merchant, dtype: int64

In [75]:
mask_suspi_top = merchant_df["id"].isin(top_suspicious_merchants.index)
merchant_df[mask_suspi_top]

      id                     name  id_merchant_category
4      5           Miller-Blevins                     4
11    12  Bell, Gonzalez and Lowe                     4
47    48                Baker Inc                     5
81    82               Day-Murray                     5
88    89           Kelley-Roberts                     5
113  114              Greene-Wood                     3

In [78]:
transaction_df

        id         day      hour  amount                 card  id_merchant
0      222  2018-01-01  21:35:10    6.22     3561954487988605           69
1     2045  2018-01-01  21:43:12    3.83     5135837688671496           85
2      395  2018-01-01  22:41:21    9.61      213193946980303           82
3     3309  2018-01-01  23:13:30   19.03     4263694062533017            5
4      567  2018-01-01  23:15:10    2.95        4498002758300           64
...    ...         ...       ...     ...                  ...          ...
3495  1979  2018-12-31  01:24:15    4.84  4723783028106084756          106
3496  2342  2018-12-31  03:33:28    3.26  4165305432349489280           64
3497   948  2018-12-31  05:53:58   10.73     5361779664174555           19
3498  1168  2018-12-31  08:22:17   11.87     4188164051171486           54
3499  2476  2018-12-31  09:50:25   19.75  4723783028106084756           16

[3500 rows x 6 columns]

In [87]:
#Tarjetas con mas trasnacciones sospechosas
#cards with the more suspicious transactions

suspicious_cards = suspiciusTransac.groupby(["card"])["card"].count().sort_values(ascending=False)
mask_suspi_card = credit_card_df["card"].isin(suspicious_cards.index)
credit_suspi = credit_card_df[mask_suspi_card]
credit_suspi

                   card  cardholder_id
6          584226564303              4
8      4268491956169254              5
11     3516952396080247              7
13     4834483169177062              8
14       30063281385429              8
16  4962915017023706562             10
19      180098539019105             11
20  4644008655884311378             11
22         501879657465             12
24      376027549341849             12
25     4711773125020499             13
26     5135837688671496             13
28     5175947111814778             14
31         503842928916             16
33     5500708021555307             16
35        4498002758300             18
36      344119623920892             18
37  4743204091443101526             19
38     5361779664174555             19
39     3561072557118696             19
45        4741042733274             23
46     4188164051171486             23
50     3582198969197591             24
52      372414832802279             25

In [83]:
#top 6
suspiciusTransac.groupby(["card"])["card"].count().sort_values(ascending=False)

card
501879657465           3
30063281385429         3
4743204091443101526    3
344119623920892        2
4644008655884311378    2
584226564303           1
4498002758300          1
503842928916           1
180098539019105        1
4741042733274          1
372414832802279        1
376027549341849        1
3582198969197591       1
4188164051171486       1
3516952396080247       1
3561072557118696       1
4711773125020499       1
4268491956169254       1
4834483169177062       1
5135837688671496       1
5361779664174555       1
5175947111814778       1
5500708021555307       1
4962915017023706562    1
Name: card, dtype: int64

In [91]:
#y poseedores de las tarjetas con transacciones sospechosas a los cuales se debrian contactat
#and posesors of cards with suspicious transaction we should contact to inform them

holders_suspi_mask = card_holder_df["id"].isin(credit_suspi["cardholder_id"])
card_holder_df[holders_suspi_mask]

    id               name
3    4     Danielle Green
4    5        Sara Cooper
6    7        Sean Taylor
7    8      Michael Floyd
9   10  Matthew Gutierrez
10  11     Brandon Pineda
11  12        Megan Price
12  13        John Martin
13  14        Gary Jacobs
15  16      Crystal Clark
17  18      Malik Carlson
18  19        Peter Mckay
22  23         Mark Lewis
23  24   Stephanie Dalton
24  25    Nancy Contreras